{
  "enclosure_url": "https://media.transistor.fm/6743e631/0661990d.mp3",
  "episode_id": "1b93311de0a43e3d682456cb159e38d633f262073a1135bdb13c99832f8df609",
  "feed_id": "Practical AI Podcast",
  "guid": "be96969b-dbf8-402d-bde2-890d642e023a",
  "link": "https://share.transistor.fm/s/6743e631",
  "published_utc": null,
  "summary": "<p>In this episode of Practical AI, Chris and Daniel explore the fascinating world of agentic AI for drone and robotic swarms, which is Chris's passion and professional focus. They unpack how autonomous vehicles (UxV), drones (UaV), and other autonomous multi-agent systems can collaborate without centralized control while exhibiting complex emergent behavior with agency and self-governance to accomplish a mission or shared goals. Chris and Dan delve into the role of AI real-time inference and edge computing to enable complex agentic multi-model autonomy, especially in challenging environments like disaster zones and remote industrial operations.</p><p>Featuring:</p><ul><li>Chris Benson – <a href=\"https://chrisbenson.com/\">Website</a>, <a href=\"https://www.linkedin.com/in/chrisbenson\">LinkedIn</a>, <a href=\"https://bsky.app/profile/chrisbenson.bsky.social\">Bluesky</a>, <a href=\"https://github.com/chrisbenson\">GitHub</a>, <a href=\"https://x.com/chrisbenson\">X</a></li><li>Daniel Whitenack – <a href=\"https://www.datadan.io/\">Website</a>, <a href=\"https://github.com/dwhitena\">GitHub</a>, <a href=\"https://x.com/dwhitena\">X</a></li></ul><p>Links:</p><ul><li><a href=\"https://www.ros.org\">ROS - Robotic Operating System</a></li><li><a href=\"https://gazebosim.org\">Gazebo</a></li><li><a href=\"https://huggingface.co/agents-course\">Hugging Face Agents Course</a></li><li><a href=\"https://en.wikipedia.org/wiki/Swarm_robotics\">Swarm Robotics | Wikipedia</a></li></ul><p><br />Chris's definition of Swarming:<br /><em>Swarming occurs when numerous independent fully-autonomous multi-agentic platforms exhibit highly-coordinated locomotive and emergent behaviors with agency and self-governance in any domain (air, ground, sea, undersea, space), functioning as a single independent logical distributed decentralized decisioning entity for purposes of C3 (command, control, communications) with human operators on-the-loop, to implement actions that achieve strategic, tactical, or operational effects in the furtherance of a mission.<br />© 2025 Chris Benson</em></p><p>Sponsors:</p><ul><li><a href=\"https://agntcy.org/\">Outshift by Cisco</a>: AGNTCY is an open source collective building the Internet of Agents. It's a collaboration layer where AI agents can communicate, discover each other, and work across frameworks. For developers, this means standardized agent discovery tools, seamless protocols for inter-agent communication, and modular components to compose and scale multi-agent workflows.</li></ul>",
  "title": "Agentic AI for Drone & Robotic Swarming"
}
