{
  "enclosure_url": "https://media.transistor.fm/0da5a2b1/3081228f.mp3",
  "episode_id": "44b64454e55dec18910d8df9d6c1f4e4ad3d02b453672f381486325eeff947f5",
  "feed_id": "Practical AI Podcast",
  "guid": "2a9fd6ef-4894-4931-a47e-6ea7df4d07dc",
  "link": "https://share.transistor.fm/s/0da5a2b1",
  "published_utc": null,
  "summary": "<p>Daniel sits down with Chelsea Linder, VP of Innovation and Entrepreneurship at TechPoint, to explore the what AI innovation and impact look like on the ground.  They discuss Chelsea's journey from the VC world into economic development/ innovation, the growth of an AI innovation network in Indiana (funded by the SBA), lessons learned from fostering AI communities, and how businesses are actually adapting to AI. Chelsea also shares insights from Techpoints AI workforce impact study, which explored AI related job creation and levels of AI adoption among other things.</p><p>Featuring:</p><ul><li>Chelsea Linder – <a href=\"https://www.linkedin.com/in/chelseaclinder/\">LinkedIn</a> </li><li>Daniel Whitenack – <a href=\"https://www.datadan.io/\">Website</a>, <a href=\"https://github.com/dwhitena\">GitHub</a>, <a href=\"https://x.com/dwhitena\">X</a></li></ul><p>Links: </p><ul><li><a href=\"https://techpoint.org/\">Techpoint</a></li></ul><p>Sponsors:</p><ul><li>Shopify – The commerce platform trusted by millions. From idea to checkout, Shopify gives you everything you need to launch and scale your business—no matter your level of experience. Build beautiful storefronts, market with built-in AI tools, and tap into the platform powering 10% of all U.S. eCommerce. <br />Start your one-dollar trial at <a href=\"http://shopify.com/practicalai\">shopify.com/practicalai</a></li><li><a href=\"http://fabi.ai/\">Fabi.ai</a> - The all-in-one data analysis platform for modern teams. From ad hoc queries to advanced analytics, Fabi lets you explore data wherever it lives—spreadsheets, Postgres, Snowflake, Airtable and more. Built-in Python and AI assistance help you move fast, then publish interactive dashboards or automate insights delivered straight to Slack, email, spreadsheets or wherever you need to share it.<br />Learn more and get started for free at <a href=\"http://fabi.ai/\">fabi.ai</a></li></ul><p>Upcoming Events: </p><ul><li>Join us at the <a href=\"https://midwestaisummit.com/\">Midwest AI Summit</a> on November 13 in Indianapolis to hear world-class speakers share how they’ve scaled AI solutions. Don’t miss the <strong>AI Engineering Lounge</strong>, where you can sit down with experts for hands-on guidance. Reserve your spot today!</li><li>Register for <a href=\"https://practicalai.fm/webinars\">upcoming webinars here</a>!</li></ul>",
  "title": "The impact of AI on the workforce: A state-level case study"
}
