{
  "enclosure_url": "https://media.transistor.fm/ba36c917/9f513f05.mp3",
  "episode_id": "a8a6e857cd2be96a4a8c56b9a253e6c4d412c604837751739422124ede29ca1b",
  "feed_id": "Practical AI Podcast",
  "guid": "fa371b17-2f78-43b7-9cba-9321b35219f3",
  "link": "https://share.transistor.fm/s/ba36c917",
  "published_utc": null,
  "summary": "<p>Chris and Daniel unpack how AI-driven document processing has rapidly evolved well beyond traditional OCR with many technical advances that fly under the radar. They explore the progression from document structure models to language-vision models, all the way to the newest innovations like Deepseek-OCR. The discussion highlights the pros and cons of these various approaches focusing on practical implementation and usage.</p><p>Featuring:</p><ul><li>Chris Benson – <a href=\"https://chrisbenson.com/\">Website</a>, <a href=\"https://www.linkedin.com/in/chrisbenson\">LinkedIn</a>, <a href=\"https://bsky.app/profile/chrisbenson.bsky.social\">Bluesky</a>, <a href=\"https://github.com/chrisbenson\">GitHub</a>, <a href=\"https://x.com/chrisbenson\">X</a></li><li>Daniel Whitenack – <a href=\"https://www.datadan.io/\">Website</a>, <a href=\"https://github.com/dwhitena\">GitHub</a>, <a href=\"https://x.com/dwhitena\">X</a></li></ul><p>Sponsors:</p><ul><li>Shopify – The commerce platform trusted by millions. From idea to checkout, Shopify gives you everything you need to launch and scale your business—no matter your level of experience. Build beautiful storefronts, market with built-in AI tools, and tap into the platform powering 10% of all U.S. eCommerce. Start your one-dollar trial at <a href=\"http://shopify.com/practicalai\">shopify.com/practicalai</a></li><li><a href=\"http://fabi.ai/\">Fabi.ai</a> - The all-in-one data analysis platform for modern teams. From ad hoc queries to advanced analytics, Fabi lets you explore data wherever it lives—spreadsheets, Postgres, Snowflake, Airtable and more. Built-in Python and AI assistance help you move fast, then publish interactive dashboards or automate insights delivered straight to Slack, email, spreadsheets or wherever you need to share it. Learn more and get started for free at <a href=\"http://fabi.ai/\">fabi.ai</a></li><li>Framer – Design and publish without limits with Framer, the free all-in-one design platform. Unlimited projects, no tool switching, and professional sites—no Figma imports or HTML hassles required. Start creating for free at <a href=\"https://www.framer.com/design/\">framer.com/design</a> with code `PRACTICALAI` for a free month of Framer Pro.</li></ul><p>Upcoming Events: </p><ul><li>Register for <a href=\"https://practicalai.fm/webinars\">upcoming webinars here</a>!</li></ul>",
  "title": "Technical advances in document understanding"
}
