{
  "enclosure_url": "https://media.transistor.fm/2cde3de8/d2cafdc4.mp3",
  "episode_id": "c1424ff0019f39837538f5fd8093c217dbc829ae6cce9ac8241f916d3a7e41dd",
  "feed_id": "Practical AI Podcast",
  "guid": "2f2c3429-83eb-40cd-9bdd-23e02e8467cd",
  "link": "https://share.transistor.fm/s/2cde3de8",
  "published_utc": null,
  "summary": "<p>In this Fully Connected episode, we dig into the recent MIT report revealing that 95% of AI pilots fail before reaching production and explore what it actually takes to succeed with AI solutions. We dive into the importance of AI model integration, asking the right questions when adopting new technologies, and why simply accessing a powerful model isn’t enough. We explore the latest AI trends, from GPT-5 to open source models, and their impact on jobs, machine learning, and enterprise strategy. </p><p>Featuring:</p><ul><li>Chris Benson – <a href=\"https://chrisbenson.com/\">Website</a>, <a href=\"https://www.linkedin.com/in/chrisbenson\">LinkedIn</a>, <a href=\"https://bsky.app/profile/chrisbenson.bsky.social\">Bluesky</a>, <a href=\"https://github.com/chrisbenson\">GitHub</a>, <a href=\"https://x.com/chrisbenson\">X</a></li><li>Daniel Whitenack – <a href=\"https://www.datadan.io/\">Website</a>, <a href=\"https://github.com/dwhitena\">GitHub</a>, <a href=\"https://x.com/dwhitena\">X</a></li></ul><p>Links: </p><ul><li><a href=\"https://mlq.ai/media/quarterly_decks/v0.1_State_of_AI_in_Business_2025_Report.pdf\">The GenAI Divide: State of AI in Business 2025</a></li><li><a href=\"https://fortune.com/2025/08/18/mit-report-95-percent-generative-ai-pilots-at-companies-failing-cfo/\">MIT Report: 95% of generative AI pilots at companies are failing</a></li></ul><p>Sponsors:</p><ul><li>Miro – The innovation workspace for the age of AI. Built for modern teams, Miro helps you turn unstructured ideas into structured outcomes—fast. Diagramming, product design, and AI-powered collaboration, all in one shared space. Start building at <a href=\"http://miro.com/\">miro.com</a></li><li>Shopify – The commerce platform trusted by millions. From idea to checkout, Shopify gives you everything you need to launch and scale your business—no matter your level of experience. Build beautiful storefronts, market with built-in AI tools, and tap into the platform powering 10% of all U.S. eCommerce.<br />Start your one-dollar trial at <a href=\"http://shopify.com/practicalai\">shopify.com/practicalai</a></li></ul><p>Upcoming Events: </p><ul><li>Join us at the <a href=\"https://midwestaisummit.com/\">Midwest AI Summit</a> on November 13 in Indianapolis to hear world-class speakers share how they’ve scaled AI solutions. Don’t miss the <strong>AI Engineering Lounge</strong>, where you can sit down with experts for hands-on guidance. Reserve your spot today!</li><li>Register for <a href=\"https://practicalai.fm/webinars\">upcoming webinars here</a>!</li></ul>",
  "title": "Cracking the code of failed AI pilots"
}
