{
  "enclosure_url": "https://media.transistor.fm/e568790b/ebe47dbc.mp3",
  "episode_id": "d9f6e2998344f293f93e6c8ba83b5e1b94cd45fda10e08c8297a1df5fd1b2aca",
  "feed_id": "Practical AI Podcast",
  "guid": "26fd3387-635e-4844-be9b-05356c6b8449",
  "link": "https://share.transistor.fm/s/e568790b",
  "published_utc": null,
  "summary": "<p>In this fully connected episode, Daniel and Chris explore the emerging concept of tiny recursive networks introduced by Samsung AI, contrasting them with large transformer based models. They explore how these small models tackle reasoning tasks with fewer parameters, less data, and iterative refinement, matching the giants on specific problems. They also discuss the ethical challenges of emotional manipulation in chatbots.</p><p>Featuring: </p><ul><li>Chris Benson – <a href=\"https://chrisbenson.com/\">Website</a>, <a href=\"https://www.linkedin.com/in/chrisbenson\">LinkedIn</a>, <a href=\"https://bsky.app/profile/chrisbenson.bsky.social\">Bluesky</a>, <a href=\"https://github.com/chrisbenson\">GitHub</a>, <a href=\"https://x.com/chrisbenson\">X</a></li><li>Daniel Whitenack – <a href=\"https://www.datadan.io/\">Website</a>, <a href=\"https://github.com/dwhitena\">GitHub</a>, <a href=\"https://x.com/dwhitena\">X</a></li></ul><p>Links:</p><ul><li><a href=\"https://arxiv.org/html/2510.04871v1\">Less is More: Recursive Reasoning with Tiny Networks</a></li><li><a href=\"https://news.harvard.edu/gazette/story/2025/09/i-exist-solely-for-you-remember/\">Researchers detail 6 ways chatbots seek to prolong ‘emotionally sensitive events’</a></li></ul><p>Sponsors:</p><ul><li>Outshift by Cisco - The open source collective building the Internet of Agents. Backed by Outshift by Cisco, AGNTCY gives developers the tools to build and deploy multi-agent software at scale. Identity, communication protocols, and modular workflows—all in one global collaboration layer. Start building at <a href=\"http://agntcy.org/\">AGNTCY.org</a>.</li><li><a href=\"http://fabi.ai/\">Fabi.ai</a> - The all-in-one data analysis platform for modern teams. From ad hoc queries to advanced analytics, Fabi lets you explore data wherever it lives—spreadsheets, Postgres, Snowflake, Airtable and more. Built-in Python and AI assistance help you move fast, then publish interactive dashboards or automate insights delivered straight to Slack, email, spreadsheets or wherever you need to share it. Learn more and get started for free at <a href=\"http://fabi.ai/\">fabi.ai</a></li><li>Miro – The innovation workspace for the age of AI. Built for modern teams, Miro helps you turn unstructured ideas into structured outcomes—fast. Diagramming, product design, and AI-powered collaboration, all in one shared space. Start building at <a href=\"http://miro.com/\">miro.com</a></li></ul><p>Upcoming Events: </p><ul><li>Join us at the <a href=\"https://midwestaisummit.com/\">Midwest AI Summit</a> on November 13 in Indianapolis to hear world-class speakers share how they’ve scaled AI solutions. Don’t miss the <strong>AI Engineering Lounge</strong>, where you can sit down with experts for hands-on guidance. Reserve your spot today!</li><li>Register for <a href=\"https://practicalai.fm/webinars\">upcoming webinars here</a>!</li></ul>",
  "title": "Tiny Recursive Networks"
}
