{
  "enclosure_url": "https://media.transistor.fm/e60866e6/972751fe.mp3",
  "episode_id": "db5fa2528f02a55f7dc34540870d9d2d5d4489f80297489d69455a32dd20f22c",
  "feed_id": "Practical AI Podcast",
  "guid": "8a585606-13c6-4064-821f-6b4be5b232ca",
  "link": "https://share.transistor.fm/s/e60866e6",
  "published_utc": null,
  "summary": "<p>As AI systems move from simple chatbots to complex agentic workflows, new security risks emerge. In this episode, Donato Capitella unpacks how increasingly complicated architectures are making agents fragile and vulnerable. These agents can be exploited through prompt injection, data exfiltration, and tool misuse. Donato shares stories from real-world penetration tests, the design patterns for building LLM agents and explains how his open-source toolkit Spikee (Simple Prompt Injection Kit for Evaluation and Exploitation) is helping red teams probe AI systems.</p><p>Featuring:</p><ul><li>Donato Capitella – <a href=\"https://www.linkedin.com/in/dcapitella/\">LinkedIn</a>, <a href=\"https://x.com/dcapitella\">X</a></li><li>Chris Benson – <a href=\"https://chrisbenson.com/\">Website</a>, <a href=\"https://www.linkedin.com/in/chrisbenson\">LinkedIn</a>, <a href=\"https://bsky.app/profile/chrisbenson.bsky.social\">Bluesky</a>, <a href=\"https://github.com/chrisbenson\">GitHub</a>, <a href=\"https://x.com/chrisbenson\">X</a></li><li>Daniel Whitenack – <a href=\"https://www.datadan.io/\">Website</a>, <a href=\"https://github.com/dwhitena\">GitHub</a>, <a href=\"https://x.com/dwhitena\">X</a></li></ul><p>Links:</p><ul><li><a href=\"https://reversec.com/\">Reversec</a></li></ul><p>Sponsors:</p><ul><li>Outshift by Cisco - The open source collective building the Internet of Agents. Backed by Outshift by Cisco, AGNTCY gives developers the tools to build and deploy multi-agent software at scale. Identity, communication protocols, and modular workflows—all in one global collaboration layer. Start building at <a href=\"http://agntcy.org/\">AGNTCY.org</a>.</li><li>Shopify – The commerce platform trusted by millions. From idea to checkout, Shopify gives you everything you need to launch and scale your business—no matter your level of experience. Build beautiful storefronts, market with built-in AI tools, and tap into the platform powering 10% of all U.S. eCommerce. Start your one-dollar trial at <a href=\"http://shopify.com/practicalai\">shopify.com/practicalai</a></li><li><a href=\"http://fabi.ai/\">Fabi.ai</a> - The all-in-one data analysis platform for modern teams. From ad hoc queries to advanced analytics, Fabi lets you explore data wherever it lives—spreadsheets, Postgres, Snowflake, Airtable and more. Built-in Python and AI assistance help you move fast, then publish interactive dashboards or automate insights delivered straight to Slack, email, spreadsheets or wherever you need to share it. Learn more and get started for free at <a href=\"http://fabi.ai/\">fabi.ai</a></li></ul><p>Upcoming Events: </p><ul><li>Join us at the <a href=\"https://midwestaisummit.com/\">Midwest AI Summit</a> on November 13 in Indianapolis to hear world-class speakers share how they’ve scaled AI solutions. Don’t miss the <strong>AI Engineering Lounge</strong>, where you can sit down with experts for hands-on guidance. Reserve your spot today!</li><li>Register for <a href=\"https://practicalai.fm/webinars\">upcoming webinars here</a>!</li></ul>",
  "title": "Dealing with increasingly complicated agents"
}
