{
  "enclosure_url": "https://media.transistor.fm/7b9cfe10/fe5031af.mp3",
  "episode_id": "f16874a077db38fc7c9834e445b96bd56f7274058658a142c7b6fe27a739e282",
  "feed_id": "Practical AI Podcast",
  "guid": "5604b042-20c2-4aa8-b9c5-95664ad78ddd",
  "link": "https://share.transistor.fm/s/7b9cfe10",
  "published_utc": null,
  "summary": "<p>Waymo’s VP of Research, Drago Anguelov, joins Practical AI to explore how advances in autonomy, vision models, and large-scale testing are shaping the future of driverless technology. The conversation dives into the dual challenges of building an onboard driver and testing that driver (via large scale simulation). Drago also gives us an update on what Waymo is doing to achieve intelligent, real-time performance while ensuring proven safety and reliability.</p><p>Featuring:</p><ul><li>Drago Anguelov – <a href=\"https://www.linkedin.com/in/dragomiranguelov/\">LinkedIn</a></li><li>Chris Benson – <a href=\"https://chrisbenson.com/\">Website</a>, <a href=\"https://www.linkedin.com/in/chrisbenson\">LinkedIn</a>, <a href=\"https://bsky.app/profile/chrisbenson.bsky.social\">Bluesky</a>, <a href=\"https://github.com/chrisbenson\">GitHub</a>, <a href=\"https://x.com/chrisbenson\">X</a></li><li>Daniel Whitenack – <a href=\"https://www.datadan.io/\">Website</a>, <a href=\"https://github.com/dwhitena\">GitHub</a>, <a href=\"https://x.com/dwhitena\">X</a></li></ul><p>Links:</p><ul><li><a href=\"https://waymo.com/research/\">Waymo Research</a></li><li><a href=\"https://waymo.com/blog/2025/06/scaling-laws-in-autonomous-driving\">New Insights for Scaling Laws in Autonomous Driving</a></li><li><a href=\"https://www.youtube.com/watch?v=11WEL7sR1GA\">AI in Motion</a></li></ul><p>Sponsors: </p><ul><li>Outshift by Cisco - The open source collective building the Internet of Agents. Backed by Outshift by Cisco, AGNTCY gives developers the tools to build and deploy multi-agent software at scale. Identity, communication protocols, and modular workflows—all in one global collaboration layer. Start building at <a href=\"http://agntcy.org/\">AGNTCY.org</a>.</li><li>Shopify – The commerce platform trusted by millions. From idea to checkout, Shopify gives you everything you need to launch and scale your business—no matter your level of experience. Build beautiful storefronts, market with built-in AI tools, and tap into the platform powering 10% of all U.S. eCommerce. Start your one-dollar trial at <a href=\"http://shopify.com/practicalai\">shopify.com/practicalai</a></li><li><a href=\"http://fabi.ai/\">Fabi.ai</a> - The all-in-one data analysis platform for modern teams. From ad hoc queries to advanced analytics, Fabi lets you explore data wherever it lives—spreadsheets, Postgres, Snowflake, Airtable and more. Built-in Python and AI assistance help you move fast, then publish interactive dashboards or automate insights delivered straight to Slack, email, spreadsheets or wherever you need to share it. Learn more and get started for free at <a href=\"http://fabi.ai/\">fabi.ai</a></li></ul><p>Upcoming Events: </p><ul><li>Register for <a href=\"https://practicalai.fm/webinars\">upcoming webinars here</a>!</li></ul>",
  "title": "Autonomous Vehicle Research at Waymo"
}
